---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CorrectionFactorSetIterator.#ctor
source: html/bc3fd3a2-d04d-70b8-5bac-f39b4328cfe2.htm
---
# Autodesk.Revit.DB.Electrical.CorrectionFactorSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public CorrectionFactorSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.